OpenNuvoton/Nano100B_BSP/SampleCode/Nu-LB-NANO130/USBD_Audio_Speaker/usbd_audio.c
    for ( i = 0; i < u32len; i++ ) {
        pBuff[i] = pSrc[i];
    }

    u32PlayPos_In += u32len;

    if (u32PlayPos_In >= BUFF_LEN) {
        u32PlayPos_In = 0;
    }
}

void AdjustCodecPll(RESAMPLE_STATE_T r)
{
    static uint16_t tb[3][3] = {{0x00C, 0x093, 0x0E9}, // 8.192
        {0x00E, 0x1D2, 0x1E3},  // * 1.005 = 8.233
        {0x009, 0x153, 0x1EF}
    }; // * .995 = 8.151
    static RESAMPLE_STATE_T current = E_RS_NONE;
    int i, s;

    if(r == current)
        return;
    else
        current = r;
    switch(r) {
    case E_RS_UP:
        s = 1;
        break;
    case E_RS_DOWN:
        s = 2;
        break;
    case E_RS_NONE:
    default:
        s = 0;
    }

    for(i=0; i<3; i++)
        ATOM_I2C_WriteWAU8822(37+i, tb[s][i]);
}

//======================================================
void TMR0_IRQHandler(void)
{
    TIMER_ClearIntFlag(TIMER0);

    if(u8PlayEn) {
        if(u32PlayPos_In >= u32PlayPos_Out) {
            if((u32PlayPos_In-u32PlayPos_Out) > (EP2_MAX_PKT_SIZE+8)) {
                AdjustCodecPll(E_RS_UP);
            } else if((u32PlayPos_In-u32PlayPos_Out) < (EP2_MAX_PKT_SIZE-8)) {
                AdjustCodecPll(E_RS_DOWN);
            } else {
                AdjustCodecPll(E_RS_NONE);
            }
        } else {
            if((u32PlayPos_In+BUFF_LEN-u32PlayPos_Out) > (EP2_MAX_PKT_SIZE+8)) {
                AdjustCodecPll(E_RS_UP);
            } else if((u32PlayPos_In+BUFF_LEN-u32PlayPos_Out) < (EP2_MAX_PKT_SIZE-8)) {
                AdjustCodecPll(E_RS_DOWN);
            } else {
                AdjustCodecPll(E_RS_NONE);
            }
        }
    } else if(u8RecEn) {
    }
}




